<!-- Вам предстоит создать простое приложение на Vue.js для
отображения списка фильмов. У вас есть массив объектов с
информацией о фильмах, и вы должны создать два компонента:
родительский компонент "Список фильмов" и дочерний компонент
"Информация о фильме".
Родительский компонент "Список фильмов" будет отображать список
фильмов, используя дочерний компонент "Информация о фильме"
для отображения дополнительных деталей о каждом фильме по
клику. -->
<template>
    <div>
        <h2>Название: {{ film.title }}</h2>
        <p>Год: {{ film.year }}</p>
    </div>
</template>

<script>
    export default {
        props: {
            film: {
                type: Object,
                default: [],
            }
        }
    }
</script>

<style scoped>

</style>